ahmed-body/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Ahmed body case: background mesh (virtual wind tunnel)                      |
| Domain: x -2..6 m (2 lengths upstream, 5 downstream), y -1.5..1.5 m,         |
|         z 0..1.5 m. Background cells are 0.2 m on a side.                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// Points 0-3: bottom corners, points 4-7: top corners (counterclockwise)
vertices
(
    (-2 -1.5 0)
    ( 6 -1.5 0)
    ( 6  1.5 0)
    (-2  1.5 0)
    (-2 -1.5 1.5)
    ( 6 -1.5 1.5)
    ( 6  1.5 1.5)
    (-2  1.5 1.5)
);

// One block split into 40 x 15 x 8 cells
blocks
(
    hex (0 1 2 3 4 5 6 7) (40 15 8) simpleGrading (1 1 1)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
